Rlesjak/am263_tractionDemo/trinv.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263x_beta" --package "ZCZ" --part "AM263x" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM263x@08.01.00"
 * @versions {"tool":"1.11.0+2225"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc        = scripting.addModule("/drivers/adc/adc", {}, false);
const adc1       = adc.addInstance();
const adc2       = adc.addInstance();
const adc3       = adc.addInstance();
const adc4       = adc.addInstance();
const adc5       = adc.addInstance();
const dac        = scripting.addModule("/drivers/dac/dac", {}, false);
const dac1       = dac.addInstance();
const edma       = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1      = edma.addInstance();
const epwm       = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1      = epwm.addInstance();
const epwm2      = epwm.addInstance();
const epwm3      = epwm.addInstance();
const epwm4      = epwm.addInstance();
const gpio       = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1      = gpio.addInstance();
const gpio2      = gpio.addInstance();
const gpio3      = gpio.addInstance();
const gpio4      = gpio.addInstance();
const gpio5      = gpio.addInstance();
const gpio6      = gpio.addInstance();
const gpio7      = gpio.addInstance();
const gpio8      = gpio.addInstance();
const gpio9      = gpio.addInstance();
const gpio10     = gpio.addInstance();
const gpio11     = gpio.addInstance();
const gpio12     = gpio.addInstance();
const gpio13     = gpio.addInstance();
const gpio14     = gpio.addInstance();
const gpio15     = gpio.addInstance();
const gpio16     = gpio.addInstance();
const gpio17     = gpio.addInstance();
const gpio18     = gpio.addInstance();
const gpio19     = gpio.addInstance();
const mcspi      = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1     = mcspi.addInstance();
const uart       = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1      = uart.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const mpu_armv76 = mpu_armv7.addInstance();
const mpu_armv77 = mpu_armv7.addInstance();
const int_xbar   = scripting.addModule("/xbar/int_xbar/int_xbar", {}, false);
const int_xbar1  = int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name               = "CONFIG_ADC4";
adc1.enableConverter     = true;
adc1.interruptPulseMode  = "ADC_PULSE_END_OF_CONV";
adc1.enableInterrupt1    = true;
adc1.soc0SampleWindow    = 15;
adc1.soc1SampleWindow    = 15;
adc1.adcClockPrescaler   = "ADC_CLK_DIV_3_0";
adc1.soc2SampleWindow    = 15;
adc1.soc4SampleWindow    = 15;
adc1.soc3SampleWindow    = 15;
adc1.soc7SampleWindow    = 15;
adc1.soc11SampleWindow   = 15;
adc1.soc15SampleWindow   = 15;
adc1.soc5SampleWindow    = 15;
adc1.soc6SampleWindow    = 15;
adc1.soc8SampleWindow    = 15;
adc1.soc9SampleWindow    = 15;
adc1.soc10SampleWindow   = 15;
adc1.soc12SampleWindow   = 15;
adc1.soc13SampleWindow   = 15;
adc1.soc14SampleWindow   = 15;
adc1.soc0Trigger         = "ADC_TRIGGER_EPWM0_SOCA";
adc1.soc1Trigger         = "ADC_TRIGGER_EPWM0_SOCA";
adc1.soc2Trigger         = "ADC_TRIGGER_EPWM0_SOCA";
adc1.soc3Trigger         = "ADC_TRIGGER_EPWM0_SOCA";
adc1.soc4Trigger         = "ADC_TRIGGER_EPWM0_SOCA";
adc1.soc5Trigger         = "ADC_TRIGGER_EPWM0_SOCA";
adc1.soc0Channel         = "ADC_CH_ADCIN3";
adc1.soc1Channel         = "ADC_CH_ADCIN1";
adc1.soc2Channel         = "ADC_CH_ADCIN1";
adc1.soc3Channel         = "ADC_CH_ADCIN3";
adc1.interrupt1SOCSource = "ADC_SOC_NUMBER5";
adc1.ADC.$assign         = "ADC4";
adc1.ADC.AIN0.$assign    = "ball.U6";
adc1.ADC.AIN1.$assign    = "ball.V5";
adc1.ADC.AIN2.$used      = false;
adc1.ADC.AIN3.$assign    = "ball.U5";
adc1.ADC.AIN4.$used      = false;
adc1.ADC.AIN5.$used      = false;

adc2.$name             = "CONFIG_ADC1";
adc2.adcClockPrescaler = "ADC_CLK_DIV_3_0";
adc2.soc0Channel       = "ADC_CH_ADCIN2";
adc2.soc0Trigger       = "ADC_TRIGGER_EPWM0_SOCA";
adc2.soc0SampleWindow  = 15;
adc2.enableConverter   = true;
adc2.ADC.$assign       = "ADC1";
adc2.ADC.AIN0.$used    = false;
adc2.ADC.AIN1.$used    = false;
adc2.ADC.AIN3.$used    = false;
adc2.ADC.AIN4.$used    = false;
adc2.ADC.AIN5.$used    = false;

adc3.$name             = "CONFIG_ADC2";
adc3.adcClockPrescaler = "ADC_CLK_DIV_3_0";
adc3.soc0Channel       = "ADC_CH_ADCIN2";
adc3.soc0SampleWindow  = 15;
adc3.soc1SampleWindow  = 15;
adc3.soc1Trigger       = "ADC_TRIGGER_EPWM0_SOCA";
adc3.soc0Trigger       = "ADC_TRIGGER_EPWM0_SOCA";
adc3.enableConverter   = true;
adc3.ADC.$assign       = "ADC2";
adc3.ADC.AIN1.$used    = false;
adc3.ADC.AIN3.$used    = false;
adc3.ADC.AIN4.$used    = false;
adc3.ADC.AIN5.$used    = false;

adc4.$name             = "CONFIG_ADC3";
adc4.adcClockPrescaler = "ADC_CLK_DIV_3_0";
adc4.enableConverter   = true;
adc4.soc0SampleWindow  = 15;
adc4.soc0Trigger       = "ADC_TRIGGER_EPWM0_SOCA";
adc4.soc1Channel       = "ADC_CH_ADCIN3";
adc4.soc1Trigger       = "ADC_TRIGGER_EPWM0_SOCA";
adc4.soc1SampleWindow  = 15;
adc4.ADC.AIN1.$used    = false;
adc4.ADC.AIN2.$used    = false;
adc4.ADC.AIN4.$used    = false;
adc4.ADC.AIN5.$used    = false;

adc5.$name             = "CONFIG_ADC0";
adc5.adcClockPrescaler = "ADC_CLK_DIV_3_0";
adc5.soc0Channel       = "ADC_CH_ADCIN2";
adc5.soc0SampleWindow  = 15;
adc5.soc0Trigger       = "ADC_TRIGGER_EPWM0_SOCA";
adc5.soc1Channel       = "ADC_CH_ADCIN3";
adc5.soc1Trigger       = "ADC_TRIGGER_EPWM0_SOCA";
adc5.soc1SampleWindow  = 15;
adc5.enableConverter   = true;
adc5.ADC.AIN0.$used    = false;
adc5.ADC.AIN1.$used    = false;
adc5.ADC.AIN4.$used    = false;
adc5.ADC.AIN5.$used    = false;

